{
  "events": [
    {
      "id": "dc1e58f8-0d33-4635-8154-7c06ad8f2801",
      "lumaUrl": "https://luma.com/seattle-v0",
      "title": "v0 Prompt to Production — Seattle [Vercel x AI Collective]",
      "description": "We're bringing Vercel's global \"Prompt to Production\" event to Seattle for the very first time. Think of it as a hands-on build session where you'll take an idea and ship an actual, live application in one evening using v0.\nWhen & Where:\nDate: Thursday, 05 February 2026\nTime: 3:00pm - 5:00pm\nLocation: Comotion Labs @ Startup Hall\nWhat's happening:\nThis is very much a doing session. Whether you're testing out a startup idea or exploring AI tooling, you'll walk away with something deployed and live.\nYou'll learn how to use v0 to generate UI components quickly and combine them with modern frameworks to build faster\nEveryone gets free credits to use v0 during the session\nWhatever gets built enters a global showcase - the v0 team picks winners who get featured in the community plus some swag\nSchedule:\n3:00pm — Welcome, quick v0 intro video\n3:30pm — Start building (we'll have some prompt ideas if you need them)\n4:30pm — Show what you made + community voting\n5:00pm — Wrap up, photos, hang out\nWho should come?\nAnyone curious about this space. Frontend devs, founders prototyping, students, people exploring AI and web development. If you want to see what building with AI tools actually looks like in practice, come through.\nWhat to bring: If you're joining in person bring your laptop and a kickass idea!\n\nPlease be advised: Unfortunately, space is very limited at these community events and we can not always accept everyone we would like to. If you are not accepted to this event, please keep applying! We appreciate your application tremendously and we are looking forward to seeing you at a future event very soon!\nThe AI Collective is a global non-profit building the human layer for the AI age. We unite 150,000+ leaders, builders, and stakeholders across 100+ forums worldwide to democratize the frontier, build trust, and coordinate how society navigates the rapid acceleration of technological progress.\nAll attendees and organizers at events affiliated with The AI Collective agree to our privacy policy and are subject to our code of conduct.",
      "startAt": "2026-02-05T15:00:00.000-08:00",
      "endAt": "2026-02-05T17:00:00.000-08:00",
      "timezone": "America/Los_Angeles",
      "location": "Seattle, Washington",
      "imageUrl": [
        "https://images.lumacdn.com/cdn-cgi/image/format=auto,fit=cover,dpr=2,anim=false,background=white,quality=75,width=500,height=500/event-covers/oz/b4ca6469-37f1-44cf-96bc-e5b944abd22d.png"
      ],
      "type": "Meetup",
      "addedAt": "2026-02-02T07:04:49.265Z"
    },
    {
      "id": "f5f98097-01d4-4ff0-8df0-d0f71e59cf35",
      "lumaUrl": "https://luma.com/ai-robotics",
      "title": "🧠 The AI Collective Seattle x Innomat AI | The Robotic AI Revolution",
      "description": "AI x Robotics: Building the Future of Manufacturing\nHosted by The AI Collective & InnoMat.AI\n📍 Northeastern University | 225 Terry Ave N, Seattle, WA 98109\n📅 Thursday, November 13, 2025 | 🕔 5:00 PM – 7:00 PM\n\n🔧 Where Cutting-Edge Tech Meets Real-World Deployment\nJoin us for an evening that brings together researchers, founders, and investors working at the frontier of AI and robotics for physical industries. This event focuses on the real challenges and real opportunities of building and scaling intelligent systems for manufacturing, construction, and infrastructure.\nYou'll hear from top minds in computer vision, human-robot interaction, optimization, deep tech investing, and AI product leadership—including voices from Northeastern, UW, Qualcomm, Broadcom, InnoMat.AI, and Madrona Venture Group.\nAgenda\n5.00 pm | Door opens\n5.30 pm | Welcome - The AI Collective & Northeastern University\n6:00 pm | Innomat AI Presentation\n6:15 pm | Dinner & Snack Break\n6.30 pm | Fireside chat - Modern Manufacturing: From Research to Deployment\n7.30 pm | Networking\n\n🎤 Featured Speakers\nDr. Joseph Weber – Director of ECE, Northeastern University Seattle | Computer Vision Scientist\nDr. Xian Li – Professor of ECE | Expert in Human-Robot Collaboration\nDr. Léonard Boussioux – Professor at UW Foster | MIT PhD in General AI & Optimization\nRolanda Fu – Investor at Madrona | Investing in Tech & AI Companies\nNeel Kishan – AI GTM & Product Lead at Qualcomm\nCharlie Sun – Founder of InnoMat.AI | Machine Learning Lead\nBhola Chhetri – Solutions Architect at Broadcom | Moderator, The AI Collective\n\n💡 What You’ll Experience\n🚀 Deep Dives on Applied Robotics & AI\nHow real-world robotics systems are built, validated, and deployed—at scale and under constraints.\n💬 Fireside Discussion: From Lab to Market\nFrom breakthrough research to venture-backed startups, learn how these leaders navigate the technical, business, and product challenges in industrial AI.\n📈 Investor Perspective: What’s Fundable in Industrial Robotics?\nHear directly from Madrona about how they evaluate frontier-tech startups—and where the real opportunities lie in hardware + AI.\n🤝 Curated Networking\nConnect with a hand-picked group of technical founders, researchers, engineers, and early-stage investors.\n\n👥 Who Should Attend\nRobotics founders and deep tech startup teams\nML/AI engineers working on perception, simulation, or autonomous systems\nVCs and innovation teams tracking industrial applications of AI\nProfessors, PhDs, and students focused on robotics, hardware, or embedded intelligence\nIndustry pros modernizing operations in manufacturing or infrastructure\n\n🍕 Food and drinks provided. \nThis is not your average AI meetup. It’s a conversation between the builders, funders, and visionaries shaping what comes next.\nPlease be advised: Unfortunately, space is very limited at these community events and we can not always accept everyone we would like to. If you are not accepted to this event, please keep applying! We appreciate your application tremendously and we are looking forward to seeing you at a future event very soon!\n\nInnoMat.AI, founded by Northeastern alum Charlie Sun, is redefining how inspections are performed in manufacturing and construction. Leveraging advanced AI and robotics, InnoMat.AI’s platform automates the full inspection lifecycle—from defect detection and material validation to workflow guidance and real-time reporting. By turning manual processes into intelligent, data-driven operations, InnoMat.AI empowers engineers to make faster, more accurate decisions—improving quality, reducing downtime, and driving performance across industrial systems.\n\nThe AI Collective is a global non-profit community uniting 100,000+ pioneers – founders, researchers, operators, and investors – exploring the frontier of AI in major tech hubs worldwide. Through events, workshops, and community-led research, we empower the AI ecosystem to collaboratively steer AI’s future toward trust, openness, and human flourishing.\nAll attendees and organizers at events affiliated with The AI Collective agree to our privacy policy and are subject to our code of conduct.",
      "startAt": "2025-11-13T17:00:00.000-08:00",
      "endAt": "2025-11-13T19:00:00.000-08:00",
      "timezone": "America/Los_Angeles",
      "location": "Seattle, Washington",
      "imageUrl": [
        "https://images.lumacdn.com/cdn-cgi/image/format=auto,fit=cover,dpr=2,anim=false,background=white,quality=75,width=500,height=500/event-covers/7k/3720c35f-907a-45c3-9b94-910d1fe6bb17.png"
      ],
      "type": "Forum",
      "addedAt": "2026-02-02T07:24:19.436Z"
    }
  ]
}